app/Modules/Keuangan/Models/KeuanganModel.php

SELECT SUM(`jumlah`) AS `jumlah`
FROM `keuangan`
WHERE `keuangan`.`user_id` = '1'
AND `jenis` = 'Pemasukan'
AND `keuangan`.`user_id` = '1'
AND MONTH(tanggal) = '03'
AND YEAR(tanggal) = '2026'
 LIMIT 1
---
    public function getPemasukan($period = 'all', $userId = null)
    {
        $builder = $this->where('jenis', 'Pemasukan');
        if ($userId)
            $builder->where('keuangan.user_id', $userId);
        $this->applyPeriodFilter($builder, $period);
        return $builder->selectSum('jumlah')->first()['jumlah'] ?? 0;

SELECT SUM(`jumlah`) AS `jumlah`
FROM `keuangan`
WHERE `keuangan`.`user_id` = '1'
AND `jenis` = 'Pengeluaran'
AND `keuangan`.`user_id` = '1'
AND MONTH(tanggal) = '03'
AND YEAR(tanggal) = '2026'
 LIMIT 1
---
    public function getPengeluaran($period = 'all', $userId = null)
    {
        $builder = $this->where('jenis', 'Pengeluaran');
        if ($userId)
            $builder->where('keuangan.user_id', $userId);
        $this->applyPeriodFilter($builder, $period);
        return $builder->selectSum('jumlah')->first()['jumlah'] ?? 0;