app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `kandang`
WHERE `kandang`.`user_id` = '1'
AND `user_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `peranakan`
WHERE `peranakan`.`user_id` = '1'
AND `user_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `peranakan`
WHERE `peranakan`.`user_id` = '1'
AND `user_id` = '1'
AND `jenis_kelamin` = 'Jantan'
SELECT COUNT(*) AS `numrows`
FROM `peranakan`
WHERE `peranakan`.`user_id` = '1'
AND `user_id` = '1'
AND `jenis_kelamin` = 'Betina'
SELECT COUNT(*) AS `numrows`
FROM `ternak`
WHERE `ternak`.`user_id` = '1'
AND `user_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `ternak`
WHERE `ternak`.`user_id` = '1'
AND `user_id` = '1'
AND `status` = 'Aktif'
SELECT COUNT(*) AS `numrows`
FROM `ternak`
WHERE `ternak`.`user_id` = '1'
AND `user_id` = '1'
AND `status` = 'Sakit'
SELECT COUNT(*) AS `numrows`
FROM `pakan`
WHERE `pakan`.`user_id` = '1'
AND `user_id` = '1'
---
    public function index(): string
    {
        $userId = session()->get('userId');
        $period = $this->request->getGet('period') ?? 'all';

        $keuanganModel = new KeuanganModel();
        $pemasukan = $keuanganModel->getPemasukan($period, $userId);
        $pengeluaran = (new KeuanganModel())->getPengeluaran($period, $userId);

        $data = [
            'title' => 'Dashboard',
            'period' => $period,
            // Keuangan
            'pemasukan' => $pemasukan,
            'pengeluaran' => $pengeluaran,
            'profit' => $pemasukan - $pengeluaran,
            // Kandang
            'totalKandang' => (new KandangModel())->where('user_id', $userId)->countAllResults(),
            'kandangList' => (new KandangModel())->getWithCount($userId),
            // Peranakan
            'totalPeranakan' => (new PeranakanModel())->where('user_id', $userId)->countAllResults(),
            'totalJantan' => (new PeranakanModel())->where('user_id', $userId)->where('jenis_kelamin', 'Jantan')->countAllResults(),
            'totalBetina' => (new PeranakanModel())->where('user_id', $userId)->where('jenis_kelamin', 'Betina')->countAllResults(),
            // Ternak
            'totalTernak' => (new TernakModel())->where('user_id', $userId)->countAllResults(),
            'ternakAktif' => (new TernakModel())->where('user_id', $userId)->where('status', 'Aktif')->countAllResults(),
            'ternakSakit' => (new TernakModel())->where('user_id', $userId)->where('status', 'Sakit')->countAllResults(),
            // Pakan
            'totalPakan' => (new PakanModel())->where('user_id', $userId)->countAllResults(),