app/Modules/Kandang/Models/KandangModel.php

    public function getWithCount($userId = null)
    {
        $builder = $this->select('kandang.*, COUNT(peranakan.id) as jumlah_ternak')
            ->join('peranakan', 'peranakan.kandang_id = kandang.id', 'left')
            ->groupBy('kandang.id');
        if ($userId) {
            $builder->where('kandang.user_id', $userId);
        }
        return $builder->findAll();
---
SELECT `kandang`.*, COUNT(peranakan.id) as jumlah_ternak
FROM `kandang`
LEFT JOIN `peranakan` ON `peranakan`.`kandang_id` = `kandang`.`id`
WHERE `kandang`.`user_id` = '1'
AND `kandang`.`user_id` = '1'
GROUP BY `kandang`.`id`